espressif/esp-idf/components/soc/esp32p4/include/soc/extmem_reg.h
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT0_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x13C)
/* EXTMEM_L1_CACHE_AUTOLOAD_SCT0_SIZE : R/W ;bitpos:[27:0] ;default: 28'h0 ; */
/*description: Those bits are used to configure the size of the first section for autoload oper
ation on L1-Cache. Note that it should be used together with L1_CACHE_AUTOLOAD_S
CT0_ADDR and L1_CACHE_AUTOLOAD_SCT0_ENA..*/
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT0_SIZE    0x0FFFFFFF
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT0_SIZE_M  ((EXTMEM_L1_CACHE_AUTOLOAD_SCT0_SIZE_V)<<(EXTMEM_L1_CACHE_AUTOLOAD_SCT0_SIZE_S))
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT0_SIZE_V  0xFFFFFFF
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT0_SIZE_S  0

#define EXTMEM_L1_CACHE_AUTOLOAD_SCT1_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x140)
/* EXTMEM_L1_CACHE_AUTOLOAD_SCT1_ADDR : R/W ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: Those bits are used to configure the start virtual address of the second section
 for autoload operation on L1-Cache. Note that it should be used together with L
1_CACHE_AUTOLOAD_SCT1_SIZE and L1_CACHE_AUTOLOAD_SCT1_ENA..*/
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT1_ADDR    0xFFFFFFFF
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT1_ADDR_M  ((EXTMEM_L1_CACHE_AUTOLOAD_SCT1_ADDR_V)<<(EXTMEM_L1_CACHE_AUTOLOAD_SCT1_ADDR_S))
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT1_ADDR_V  0xFFFFFFFF
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT1_ADDR_S  0

#define EXTMEM_L1_CACHE_AUTOLOAD_SCT1_SIZE_REG          (DR_REG_EXTMEM_BASE + 0x144)
/* EXTMEM_L1_CACHE_AUTOLOAD_SCT1_SIZE : R/W ;bitpos:[27:0] ;default: 28'h0 ; */
/*description: Those bits are used to configure the size of the second section for autoload ope
ration on L1-Cache. Note that it should be used together with L1_CACHE_AUTOLOAD_
SCT1_ADDR and L1_CACHE_AUTOLOAD_SCT1_ENA..*/
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT1_SIZE    0x0FFFFFFF
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT1_SIZE_M  ((EXTMEM_L1_CACHE_AUTOLOAD_SCT1_SIZE_V)<<(EXTMEM_L1_CACHE_AUTOLOAD_SCT1_SIZE_S))
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT1_SIZE_V  0xFFFFFFF
#define EXTMEM_L1_CACHE_AUTOLOAD_SCT1_SIZE_S  0

#define EXTMEM_L1_CACHE_ACS_CNT_INT_ENA_REG          (DR_REG_EXTMEM_BASE + 0x158)
/* EXTMEM_L1_DBUS_OVF_INT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt of one of counters overflow that occurs in L
1-DCache due to bus1 accesses L1-DCache..*/
#define EXTMEM_L1_DBUS_OVF_INT_ENA    (BIT(5))
#define EXTMEM_L1_DBUS_OVF_INT_ENA_M  (BIT(5))
#define EXTMEM_L1_DBUS_OVF_INT_ENA_V  0x1
#define EXTMEM_L1_DBUS_OVF_INT_ENA_S  5
/* EXTMEM_L1_IBUS_OVF_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt of one of counters overflow that occurs in L
1-DCache due to bus0 accesses L1-DCache..*/
#define EXTMEM_L1_IBUS_OVF_INT_ENA    (BIT(4))
#define EXTMEM_L1_IBUS_OVF_INT_ENA_M  (BIT(4))
#define EXTMEM_L1_IBUS_OVF_INT_ENA_V  0x1
#define EXTMEM_L1_IBUS_OVF_INT_ENA_S  4

#define EXTMEM_L1_CACHE_ACS_CNT_INT_CLR_REG          (DR_REG_EXTMEM_BASE + 0x15C)
/* EXTMEM_L1_DBUS_OVF_INT_CLR : WT ;bitpos:[5] ;default: 1'b0 ; */
/*description: The bit is used to clear counters overflow interrupt and counters in L1-DCache d
ue to bus1 accesses L1-DCache..*/
#define EXTMEM_L1_DBUS_OVF_INT_CLR    (BIT(5))
#define EXTMEM_L1_DBUS_OVF_INT_CLR_M  (BIT(5))
#define EXTMEM_L1_DBUS_OVF_INT_CLR_V  0x1
#define EXTMEM_L1_DBUS_OVF_INT_CLR_S  5
/* EXTMEM_L1_IBUS_OVF_INT_CLR : WT ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to clear counters overflow interrupt and counters in L1-DCache d
ue to bus0 accesses L1-DCache..*/
#define EXTMEM_L1_IBUS_OVF_INT_CLR    (BIT(4))
#define EXTMEM_L1_IBUS_OVF_INT_CLR_M  (BIT(4))
#define EXTMEM_L1_IBUS_OVF_INT_CLR_V  0x1
#define EXTMEM_L1_IBUS_OVF_INT_CLR_S  4

#define EXTMEM_L1_CACHE_ACS_CNT_INT_RAW_REG          (DR_REG_EXTMEM_BASE + 0x160)
/* EXTMEM_L1_DBUS_OVF_INT_RAW : R/WTC/SS ;bitpos:[5] ;default: 1'b0 ; */
/*description: The raw bit of the interrupt of one of counters overflow that occurs in L1-DCach
e due to bus1 accesses L1-DCache..*/
#define EXTMEM_L1_DBUS_OVF_INT_RAW    (BIT(5))
#define EXTMEM_L1_DBUS_OVF_INT_RAW_M  (BIT(5))
#define EXTMEM_L1_DBUS_OVF_INT_RAW_V  0x1
#define EXTMEM_L1_DBUS_OVF_INT_RAW_S  5
/* EXTMEM_L1_IBUS_OVF_INT_RAW : R/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw bit of the interrupt of one of counters overflow that occurs in L1-DCach
e due to bus0 accesses L1-DCache..*/
#define EXTMEM_L1_IBUS_OVF_INT_RAW    (BIT(4))
#define EXTMEM_L1_IBUS_OVF_INT_RAW_M  (BIT(4))
#define EXTMEM_L1_IBUS_OVF_INT_RAW_V  0x1
#define EXTMEM_L1_IBUS_OVF_INT_RAW_S  4

#define EXTMEM_L1_CACHE_ACS_CNT_INT_ST_REG          (DR_REG_EXTMEM_BASE + 0x164)
/* EXTMEM_L1_DBUS_OVF_INT_ST : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: The bit indicates the interrupt status of one of counters overflow that occurs i
n L1-DCache due to bus1 accesses L1-DCache..*/
#define EXTMEM_L1_DBUS_OVF_INT_ST    (BIT(5))
#define EXTMEM_L1_DBUS_OVF_INT_ST_M  (BIT(5))
#define EXTMEM_L1_DBUS_OVF_INT_ST_V  0x1
#define EXTMEM_L1_DBUS_OVF_INT_ST_S  5
/* EXTMEM_L1_IBUS_OVF_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit indicates the interrupt status of one of counters overflow that occurs i
n L1-DCache due to bus0 accesses L1-DCache..*/
#define EXTMEM_L1_IBUS_OVF_INT_ST    (BIT(4))
#define EXTMEM_L1_IBUS_OVF_INT_ST_M  (BIT(4))
#define EXTMEM_L1_IBUS_OVF_INT_ST_V  0x1
#define EXTMEM_L1_IBUS_OVF_INT_ST_S  4

#define EXTMEM_L1_CACHE_ACS_FAIL_INT_ENA_REG          (DR_REG_EXTMEM_BASE + 0x168)
/* EXTMEM_L1_CACHE_FAIL_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt of access fail that occurs in L1-DCache due
to cpu accesses L1-DCache..*/
#define EXTMEM_L1_CACHE_FAIL_INT_ENA    (BIT(4))
#define EXTMEM_L1_CACHE_FAIL_INT_ENA_M  (BIT(4))
#define EXTMEM_L1_CACHE_FAIL_INT_ENA_V  0x1
#define EXTMEM_L1_CACHE_FAIL_INT_ENA_S  4

#define EXTMEM_L1_CACHE_ACS_FAIL_INT_CLR_REG          (DR_REG_EXTMEM_BASE + 0x16C)
/* EXTMEM_L1_CACHE_FAIL_INT_CLR : WT ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt of access fail that occurs in L1-DCache due t
o cpu accesses L1-DCache..*/
#define EXTMEM_L1_CACHE_FAIL_INT_CLR    (BIT(4))
#define EXTMEM_L1_CACHE_FAIL_INT_CLR_M  (BIT(4))
#define EXTMEM_L1_CACHE_FAIL_INT_CLR_V  0x1
#define EXTMEM_L1_CACHE_FAIL_INT_CLR_S  4

#define EXTMEM_L1_CACHE_ACS_FAIL_INT_RAW_REG          (DR_REG_EXTMEM_BASE + 0x170)
/* EXTMEM_L1_CACHE_FAIL_INT_RAW : R/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw bit of the interrupt of access fail that occurs in L1-DCache..*/
#define EXTMEM_L1_CACHE_FAIL_INT_RAW    (BIT(4))
#define EXTMEM_L1_CACHE_FAIL_INT_RAW_M  (BIT(4))
#define EXTMEM_L1_CACHE_FAIL_INT_RAW_V  0x1
#define EXTMEM_L1_CACHE_FAIL_INT_RAW_S  4

#define EXTMEM_L1_CACHE_ACS_FAIL_INT_ST_REG          (DR_REG_EXTMEM_BASE + 0x174)
/* EXTMEM_L1_CACHE_FAIL_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit indicates the interrupt status of access fail that occurs in L1-DCache d
ue to cpu accesses L1-DCache..*/
#define EXTMEM_L1_CACHE_FAIL_INT_ST    (BIT(4))
#define EXTMEM_L1_CACHE_FAIL_INT_ST_M  (BIT(4))
#define EXTMEM_L1_CACHE_FAIL_INT_ST_V  0x1
#define EXTMEM_L1_CACHE_FAIL_INT_ST_S  4

#define EXTMEM_L1_CACHE_ACS_CNT_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x178)
/* EXTMEM_L1_DBUS_CNT_CLR : WT ;bitpos:[21] ;default: 1'b0 ; */
/*description: The bit is used to clear dbus1 counter in L1-DCache..*/
#define EXTMEM_L1_DBUS_CNT_CLR    (BIT(21))
#define EXTMEM_L1_DBUS_CNT_CLR_M  (BIT(21))
#define EXTMEM_L1_DBUS_CNT_CLR_V  0x1
#define EXTMEM_L1_DBUS_CNT_CLR_S  21
/* EXTMEM_L1_IBUS_CNT_CLR : WT ;bitpos:[20] ;default: 1'b0 ; */
/*description: The bit is used to clear dbus0 counter in L1-DCache..*/
#define EXTMEM_L1_IBUS_CNT_CLR    (BIT(20))
#define EXTMEM_L1_IBUS_CNT_CLR_M  (BIT(20))
#define EXTMEM_L1_IBUS_CNT_CLR_V  0x1
#define EXTMEM_L1_IBUS_CNT_CLR_S  20
/* EXTMEM_L1_DBUS_CNT_ENA : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: The bit is used to enable dbus1 counter in L1-DCache..*/
#define EXTMEM_L1_DBUS_CNT_ENA    (BIT(5))
#define EXTMEM_L1_DBUS_CNT_ENA_M  (BIT(5))
#define EXTMEM_L1_DBUS_CNT_ENA_V  0x1
#define EXTMEM_L1_DBUS_CNT_ENA_S  5
/* EXTMEM_L1_IBUS_CNT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to enable dbus0 counter in L1-DCache..*/
#define EXTMEM_L1_IBUS_CNT_ENA    (BIT(4))
#define EXTMEM_L1_IBUS_CNT_ENA_M  (BIT(4))
#define EXTMEM_L1_IBUS_CNT_ENA_V  0x1
#define EXTMEM_L1_IBUS_CNT_ENA_S  4

#define EXTMEM_L1_IBUS_ACS_HIT_CNT_REG          (DR_REG_EXTMEM_BASE + 0x1BC)
/* EXTMEM_L1_IBUS_HIT_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of hits when bus0 accesses L1-Cache..*/
#define EXTMEM_L1_IBUS_HIT_CNT    0xFFFFFFFF
#define EXTMEM_L1_IBUS_HIT_CNT_M  ((EXTMEM_L1_IBUS_HIT_CNT_V)<<(EXTMEM_L1_IBUS_HIT_CNT_S))
#define EXTMEM_L1_IBUS_HIT_CNT_V  0xFFFFFFFF
#define EXTMEM_L1_IBUS_HIT_CNT_S  0

#define EXTMEM_L1_IBUS_ACS_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x1C0)
/* EXTMEM_L1_IBUS_MISS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of missing when bus0 accesses L1-Cache..*/
#define EXTMEM_L1_IBUS_MISS_CNT    0xFFFFFFFF
#define EXTMEM_L1_IBUS_MISS_CNT_M  ((EXTMEM_L1_IBUS_MISS_CNT_V)<<(EXTMEM_L1_IBUS_MISS_CNT_S))
#define EXTMEM_L1_IBUS_MISS_CNT_V  0xFFFFFFFF
#define EXTMEM_L1_IBUS_MISS_CNT_S  0

#define EXTMEM_L1_IBUS_ACS_CONFLICT_CNT_REG          (DR_REG_EXTMEM_BASE + 0x1C4)
/* EXTMEM_L1_IBUS_CONFLICT_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of access-conflicts when bus0 accesses L1-Cache..*/
#define EXTMEM_L1_IBUS_CONFLICT_CNT    0xFFFFFFFF
#define EXTMEM_L1_IBUS_CONFLICT_CNT_M  ((EXTMEM_L1_IBUS_CONFLICT_CNT_V)<<(EXTMEM_L1_IBUS_CONFLICT_CNT_S))
#define EXTMEM_L1_IBUS_CONFLICT_CNT_V  0xFFFFFFFF
#define EXTMEM_L1_IBUS_CONFLICT_CNT_S  0

#define EXTMEM_L1_IBUS_ACS_NXTLVL_CNT_REG          (DR_REG_EXTMEM_BASE + 0x1C8)
/* EXTMEM_L1_IBUS_NXTLVL_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of times that L1-Cache accesses L2-Cache due to
bus0 accessing L1-Cache..*/
#define EXTMEM_L1_IBUS_NXTLVL_CNT    0xFFFFFFFF
#define EXTMEM_L1_IBUS_NXTLVL_CNT_M  ((EXTMEM_L1_IBUS_NXTLVL_CNT_V)<<(EXTMEM_L1_IBUS_NXTLVL_CNT_S))
#define EXTMEM_L1_IBUS_NXTLVL_CNT_V  0xFFFFFFFF
#define EXTMEM_L1_IBUS_NXTLVL_CNT_S  0

