espressif/esp-idf/components/soc/esp32p4/include/soc/extmem_reg.h
#define EXTMEM_L1_DBUS_ACS_HIT_CNT_REG          (DR_REG_EXTMEM_BASE + 0x1CC)
/* EXTMEM_L1_DBUS_HIT_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of hits when bus1 accesses L1-Cache..*/
#define EXTMEM_L1_DBUS_HIT_CNT    0xFFFFFFFF
#define EXTMEM_L1_DBUS_HIT_CNT_M  ((EXTMEM_L1_DBUS_HIT_CNT_V)<<(EXTMEM_L1_DBUS_HIT_CNT_S))
#define EXTMEM_L1_DBUS_HIT_CNT_V  0xFFFFFFFF
#define EXTMEM_L1_DBUS_HIT_CNT_S  0

#define EXTMEM_L1_DBUS_ACS_MISS_CNT_REG          (DR_REG_EXTMEM_BASE + 0x1D0)
/* EXTMEM_L1_DBUS_MISS_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of missing when bus1 accesses L1-Cache..*/
#define EXTMEM_L1_DBUS_MISS_CNT    0xFFFFFFFF
#define EXTMEM_L1_DBUS_MISS_CNT_M  ((EXTMEM_L1_DBUS_MISS_CNT_V)<<(EXTMEM_L1_DBUS_MISS_CNT_S))
#define EXTMEM_L1_DBUS_MISS_CNT_V  0xFFFFFFFF
#define EXTMEM_L1_DBUS_MISS_CNT_S  0

#define EXTMEM_L1_DBUS_ACS_CONFLICT_CNT_REG          (DR_REG_EXTMEM_BASE + 0x1D4)
/* EXTMEM_L1_DBUS_CONFLICT_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of access-conflicts when bus1 accesses L1-Cache..*/
#define EXTMEM_L1_DBUS_CONFLICT_CNT    0xFFFFFFFF
#define EXTMEM_L1_DBUS_CONFLICT_CNT_M  ((EXTMEM_L1_DBUS_CONFLICT_CNT_V)<<(EXTMEM_L1_DBUS_CONFLICT_CNT_S))
#define EXTMEM_L1_DBUS_CONFLICT_CNT_V  0xFFFFFFFF
#define EXTMEM_L1_DBUS_CONFLICT_CNT_S  0

#define EXTMEM_L1_DBUS_ACS_NXTLVL_CNT_REG          (DR_REG_EXTMEM_BASE + 0x1D8)
/* EXTMEM_L1_DBUS_NXTLVL_CNT : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the number of times that L1-Cache accesses L2-Cache due to
bus1 accessing L1-Cache..*/
#define EXTMEM_L1_DBUS_NXTLVL_CNT    0xFFFFFFFF
#define EXTMEM_L1_DBUS_NXTLVL_CNT_M  ((EXTMEM_L1_DBUS_NXTLVL_CNT_V)<<(EXTMEM_L1_DBUS_NXTLVL_CNT_S))
#define EXTMEM_L1_DBUS_NXTLVL_CNT_V  0xFFFFFFFF
#define EXTMEM_L1_DBUS_NXTLVL_CNT_S  0

#define EXTMEM_L1_CACHE_ACS_FAIL_ID_ATTR_REG          (DR_REG_EXTMEM_BASE + 0x21C)
/* EXTMEM_L1_CACHE_FAIL_ATTR : RO ;bitpos:[31:16] ;default: 16'h0 ; */
/*description: The register records the attribution of fail-access when cache accesses L1-Cache
..*/
#define EXTMEM_L1_CACHE_FAIL_ATTR    0x0000FFFF
#define EXTMEM_L1_CACHE_FAIL_ATTR_M  ((EXTMEM_L1_CACHE_FAIL_ATTR_V)<<(EXTMEM_L1_CACHE_FAIL_ATTR_S))
#define EXTMEM_L1_CACHE_FAIL_ATTR_V  0xFFFF
#define EXTMEM_L1_CACHE_FAIL_ATTR_S  16
/* EXTMEM_L1_CACHE_FAIL_ID : RO ;bitpos:[15:0] ;default: 16'h0 ; */
/*description: The register records the ID of fail-access when cache accesses L1-Cache..*/
#define EXTMEM_L1_CACHE_FAIL_ID    0x0000FFFF
#define EXTMEM_L1_CACHE_FAIL_ID_M  ((EXTMEM_L1_CACHE_FAIL_ID_V)<<(EXTMEM_L1_CACHE_FAIL_ID_S))
#define EXTMEM_L1_CACHE_FAIL_ID_V  0xFFFF
#define EXTMEM_L1_CACHE_FAIL_ID_S  0

#define EXTMEM_L1_CACHE_ACS_FAIL_ADDR_REG          (DR_REG_EXTMEM_BASE + 0x220)
/* EXTMEM_L1_CACHE_FAIL_ADDR : RO ;bitpos:[31:0] ;default: 32'h0 ; */
/*description: The register records the address of fail-access when cache accesses L1-Cache..*/
#define EXTMEM_L1_CACHE_FAIL_ADDR    0xFFFFFFFF
#define EXTMEM_L1_CACHE_FAIL_ADDR_M  ((EXTMEM_L1_CACHE_FAIL_ADDR_V)<<(EXTMEM_L1_CACHE_FAIL_ADDR_S))
#define EXTMEM_L1_CACHE_FAIL_ADDR_V  0xFFFFFFFF
#define EXTMEM_L1_CACHE_FAIL_ADDR_S  0

#define EXTMEM_L1_CACHE_SYNC_PRELOAD_INT_ENA_REG          (DR_REG_EXTMEM_BASE + 0x224)
/* EXTMEM_L1_CACHE_SYNC_ERR_INT_ENA : R/W ;bitpos:[13] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt of Cache sync-operation error..*/
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_ENA    (BIT(13))
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_ENA_M  (BIT(13))
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_ENA_V  0x1
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_ENA_S  13
/* EXTMEM_L1_CACHE_PLD_ERR_INT_ENA : R/W ;bitpos:[11] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt of L1-Cache preload-operation error..*/
#define EXTMEM_L1_CACHE_PLD_ERR_INT_ENA    (BIT(11))
#define EXTMEM_L1_CACHE_PLD_ERR_INT_ENA_M  (BIT(11))
#define EXTMEM_L1_CACHE_PLD_ERR_INT_ENA_V  0x1
#define EXTMEM_L1_CACHE_PLD_ERR_INT_ENA_S  11
/* EXTMEM_L1_CACHE_SYNC_DONE_INT_ENA : R/W ;bitpos:[6] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt of Cache sync-operation done..*/
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_ENA    (BIT(6))
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_ENA_M  (BIT(6))
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_ENA_V  0x1
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_ENA_S  6
/* EXTMEM_L1_CACHE_PLD_DONE_INT_ENA : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to enable interrupt of L1-Cache preload-operation. If preload op
eration is done, interrupt occurs..*/
#define EXTMEM_L1_CACHE_PLD_DONE_INT_ENA    (BIT(4))
#define EXTMEM_L1_CACHE_PLD_DONE_INT_ENA_M  (BIT(4))
#define EXTMEM_L1_CACHE_PLD_DONE_INT_ENA_V  0x1
#define EXTMEM_L1_CACHE_PLD_DONE_INT_ENA_S  4

#define EXTMEM_L1_CACHE_SYNC_PRELOAD_INT_CLR_REG          (DR_REG_EXTMEM_BASE + 0x228)
/* EXTMEM_L1_CACHE_SYNC_ERR_INT_CLR : WT ;bitpos:[13] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt of Cache sync-operation error..*/
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_CLR    (BIT(13))
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_CLR_M  (BIT(13))
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_CLR_V  0x1
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_CLR_S  13
/* EXTMEM_L1_CACHE_PLD_ERR_INT_CLR : WT ;bitpos:[11] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt of L1-Cache preload-operation error..*/
#define EXTMEM_L1_CACHE_PLD_ERR_INT_CLR    (BIT(11))
#define EXTMEM_L1_CACHE_PLD_ERR_INT_CLR_M  (BIT(11))
#define EXTMEM_L1_CACHE_PLD_ERR_INT_CLR_V  0x1
#define EXTMEM_L1_CACHE_PLD_ERR_INT_CLR_S  11
/* EXTMEM_L1_CACHE_SYNC_DONE_INT_CLR : WT ;bitpos:[6] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt that occurs only when Cache sync-operation is
 done..*/
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_CLR    (BIT(6))
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_CLR_M  (BIT(6))
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_CLR_V  0x1
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_CLR_S  6
/* EXTMEM_L1_CACHE_PLD_DONE_INT_CLR : WT ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to clear interrupt that occurs only when L1-Cache preload-operat
ion is done..*/
#define EXTMEM_L1_CACHE_PLD_DONE_INT_CLR    (BIT(4))
#define EXTMEM_L1_CACHE_PLD_DONE_INT_CLR_M  (BIT(4))
#define EXTMEM_L1_CACHE_PLD_DONE_INT_CLR_V  0x1
#define EXTMEM_L1_CACHE_PLD_DONE_INT_CLR_S  4

#define EXTMEM_L1_CACHE_SYNC_PRELOAD_INT_RAW_REG          (DR_REG_EXTMEM_BASE + 0x22C)
/* EXTMEM_L1_CACHE_SYNC_ERR_INT_RAW : R/WTC/SS ;bitpos:[13] ;default: 1'b0 ; */
/*description: The raw bit of the interrupt that occurs only when Cache sync-operation error oc
curs..*/
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_RAW    (BIT(13))
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_RAW_M  (BIT(13))
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_RAW_V  0x1
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_RAW_S  13
/* EXTMEM_L1_CACHE_PLD_ERR_INT_RAW : R/WTC/SS ;bitpos:[11] ;default: 1'b0 ; */
/*description: The raw bit of the interrupt that occurs only when L1-Cache preload-operation er
ror occurs..*/
#define EXTMEM_L1_CACHE_PLD_ERR_INT_RAW    (BIT(11))
#define EXTMEM_L1_CACHE_PLD_ERR_INT_RAW_M  (BIT(11))
#define EXTMEM_L1_CACHE_PLD_ERR_INT_RAW_V  0x1
#define EXTMEM_L1_CACHE_PLD_ERR_INT_RAW_S  11
/* EXTMEM_L1_CACHE_SYNC_DONE_INT_RAW : R/WTC/SS ;bitpos:[6] ;default: 1'b0 ; */
/*description: The raw bit of the interrupt that occurs only when Cache sync-operation is done..*/
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_RAW    (BIT(6))
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_RAW_M  (BIT(6))
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_RAW_V  0x1
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_RAW_S  6
/* EXTMEM_L1_CACHE_PLD_DONE_INT_RAW : R/WTC/SS ;bitpos:[4] ;default: 1'b0 ; */
/*description: The raw bit of the interrupt that occurs only when L1-Cache preload-operation is
 done..*/
#define EXTMEM_L1_CACHE_PLD_DONE_INT_RAW    (BIT(4))
#define EXTMEM_L1_CACHE_PLD_DONE_INT_RAW_M  (BIT(4))
#define EXTMEM_L1_CACHE_PLD_DONE_INT_RAW_V  0x1
#define EXTMEM_L1_CACHE_PLD_DONE_INT_RAW_S  4

#define EXTMEM_L1_CACHE_SYNC_PRELOAD_INT_ST_REG          (DR_REG_EXTMEM_BASE + 0x230)
/* EXTMEM_L1_CACHE_SYNC_ERR_INT_ST : RO ;bitpos:[13] ;default: 1'b0 ; */
/*description: The bit indicates the status of the interrupt of Cache sync-operation error..*/
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_ST    (BIT(13))
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_ST_M  (BIT(13))
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_ST_V  0x1
#define EXTMEM_L1_CACHE_SYNC_ERR_INT_ST_S  13
/* EXTMEM_L1_CACHE_PLD_ERR_INT_ST : RO ;bitpos:[11] ;default: 1'b0 ; */
/*description: The bit indicates the status of the interrupt of L1-Cache preload-operation erro
r..*/
#define EXTMEM_L1_CACHE_PLD_ERR_INT_ST    (BIT(11))
#define EXTMEM_L1_CACHE_PLD_ERR_INT_ST_M  (BIT(11))
#define EXTMEM_L1_CACHE_PLD_ERR_INT_ST_V  0x1
#define EXTMEM_L1_CACHE_PLD_ERR_INT_ST_S  11
/* EXTMEM_L1_CACHE_SYNC_DONE_INT_ST : RO ;bitpos:[6] ;default: 1'b0 ; */
/*description: The bit indicates the status of the interrupt that occurs only when Cache sync-o
peration is done..*/
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_ST    (BIT(6))
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_ST_M  (BIT(6))
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_ST_V  0x1
#define EXTMEM_L1_CACHE_SYNC_DONE_INT_ST_S  6
/* EXTMEM_L1_CACHE_PLD_DONE_INT_ST : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit indicates the status of the interrupt that occurs only when L1-Cache pre
load-operation is done..*/
#define EXTMEM_L1_CACHE_PLD_DONE_INT_ST    (BIT(4))
#define EXTMEM_L1_CACHE_PLD_DONE_INT_ST_M  (BIT(4))
#define EXTMEM_L1_CACHE_PLD_DONE_INT_ST_V  0x1
#define EXTMEM_L1_CACHE_PLD_DONE_INT_ST_S  4

#define EXTMEM_L1_CACHE_SYNC_PRELOAD_EXCEPTION_REG          (DR_REG_EXTMEM_BASE + 0x234)
/* EXTMEM_L1_CACHE_SYNC_ERR_CODE : RO ;bitpos:[13:12] ;default: 2'h0 ; */
/*description: The values 0-2 are available which means sync map, command conflict and size are
 error in Cache System..*/
#define EXTMEM_L1_CACHE_SYNC_ERR_CODE    0x00000003
#define EXTMEM_L1_CACHE_SYNC_ERR_CODE_M  ((EXTMEM_L1_CACHE_SYNC_ERR_CODE_V)<<(EXTMEM_L1_CACHE_SYNC_ERR_CODE_S))
#define EXTMEM_L1_CACHE_SYNC_ERR_CODE_V  0x3
#define EXTMEM_L1_CACHE_SYNC_ERR_CODE_S  12
/* EXTMEM_L1_CACHE_PLD_ERR_CODE : RO ;bitpos:[9:8] ;default: 2'h0 ; */
/*description: The value 2 is Only available which means preload size is error in L1-Cache..*/
#define EXTMEM_L1_CACHE_PLD_ERR_CODE    0x00000003
#define EXTMEM_L1_CACHE_PLD_ERR_CODE_M  ((EXTMEM_L1_CACHE_PLD_ERR_CODE_V)<<(EXTMEM_L1_CACHE_PLD_ERR_CODE_S))
#define EXTMEM_L1_CACHE_PLD_ERR_CODE_V  0x3
#define EXTMEM_L1_CACHE_PLD_ERR_CODE_S  8

#define EXTMEM_L1_CACHE_SYNC_RST_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x238)
/* EXTMEM_L1_CACHE_SYNC_RST : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: set this bit to reset sync-logic inside L1-Cache. Recommend that this should onl
y be used to initialize sync-logic when some fatal error of sync-logic occurs..*/
#define EXTMEM_L1_CACHE_SYNC_RST    (BIT(4))
#define EXTMEM_L1_CACHE_SYNC_RST_M  (BIT(4))
#define EXTMEM_L1_CACHE_SYNC_RST_V  0x1
#define EXTMEM_L1_CACHE_SYNC_RST_S  4

#define EXTMEM_L1_CACHE_PRELOAD_RST_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x23C)
/* EXTMEM_L1_CACHE_PLD_RST : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: set this bit to reset preload-logic inside L1-Cache. Recommend that this should
only be used to initialize preload-logic when some fatal error of preload-logic
occurs..*/
#define EXTMEM_L1_CACHE_PLD_RST    (BIT(4))
#define EXTMEM_L1_CACHE_PLD_RST_M  (BIT(4))
#define EXTMEM_L1_CACHE_PLD_RST_V  0x1
#define EXTMEM_L1_CACHE_PLD_RST_S  4

#define EXTMEM_L1_CACHE_AUTOLOAD_BUF_CLR_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x240)
/* EXTMEM_L1_CACHE_ALD_BUF_CLR : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: set this bit to clear autoload-buffer inside L1-Cache. If this bit is active, au
toload will not work in L1-Cache. This bit should not be active when autoload wo
rks in L1-Cache..*/
#define EXTMEM_L1_CACHE_ALD_BUF_CLR    (BIT(4))
#define EXTMEM_L1_CACHE_ALD_BUF_CLR_M  (BIT(4))
#define EXTMEM_L1_CACHE_ALD_BUF_CLR_V  0x1
#define EXTMEM_L1_CACHE_ALD_BUF_CLR_S  4

#define EXTMEM_L1_UNALLOCATE_BUFFER_CLEAR_REG          (DR_REG_EXTMEM_BASE + 0x244)
/* EXTMEM_L1_CACHE_UNALLOC_CLR : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: The bit is used to clear the unallocate request buffer of l1 cache where the una
llocate request is responsed but not completed..*/
#define EXTMEM_L1_CACHE_UNALLOC_CLR    (BIT(4))
#define EXTMEM_L1_CACHE_UNALLOC_CLR_M  (BIT(4))
#define EXTMEM_L1_CACHE_UNALLOC_CLR_V  0x1
#define EXTMEM_L1_CACHE_UNALLOC_CLR_S  4

#define EXTMEM_L1_CACHE_OBJECT_CTRL_REG          (DR_REG_EXTMEM_BASE + 0x248)
/* EXTMEM_L1_CACHE_MEM_OBJECT : R/W ;bitpos:[10] ;default: 1'b0 ; */
/*description: Set this bit to set L1-Cache data memory as object. This bit should be onehot wi
th the others fields inside this register..*/
#define EXTMEM_L1_CACHE_MEM_OBJECT    (BIT(10))
#define EXTMEM_L1_CACHE_MEM_OBJECT_M  (BIT(10))
#define EXTMEM_L1_CACHE_MEM_OBJECT_V  0x1
#define EXTMEM_L1_CACHE_MEM_OBJECT_S  10
/* EXTMEM_L1_CACHE_TAG_OBJECT : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: Set this bit to set L1-Cache tag memory as object. This bit should be onehot wit
h the others fields inside this register..*/
#define EXTMEM_L1_CACHE_TAG_OBJECT    (BIT(4))
#define EXTMEM_L1_CACHE_TAG_OBJECT_M  (BIT(4))
#define EXTMEM_L1_CACHE_TAG_OBJECT_V  0x1
#define EXTMEM_L1_CACHE_TAG_OBJECT_S  4

