espressif/esp-idf/components/soc/esp32p4/include/soc/extmem_reg.h
#define EXTMEM_L1_CACHE_WAY_OBJECT_REG          (DR_REG_EXTMEM_BASE + 0x24C)
/* EXTMEM_L1_CACHE_WAY_OBJECT : R/W ;bitpos:[2:0] ;default: 3'h0 ; */
/*description: Set this bits to select which way of the tag-object will be accessed. 0: way0, 1
: way1, 2: way2, 3: way3, ?, 7: way7..*/
#define EXTMEM_L1_CACHE_WAY_OBJECT    0x00000007
#define EXTMEM_L1_CACHE_WAY_OBJECT_M  ((EXTMEM_L1_CACHE_WAY_OBJECT_V)<<(EXTMEM_L1_CACHE_WAY_OBJECT_S))
#define EXTMEM_L1_CACHE_WAY_OBJECT_V  0x7
#define EXTMEM_L1_CACHE_WAY_OBJECT_S  0

#define EXTMEM_L1_CACHE_VADDR_REG          (DR_REG_EXTMEM_BASE + 0x250)
/* EXTMEM_L1_CACHE_VADDR : R/W ;bitpos:[31:0] ;default: 32'h40000000 ; */
/*description: Those bits stores the virtual address which will decide where inside the specifi
ed tag memory object will be accessed..*/
#define EXTMEM_L1_CACHE_VADDR    0xFFFFFFFF
#define EXTMEM_L1_CACHE_VADDR_M  ((EXTMEM_L1_CACHE_VADDR_V)<<(EXTMEM_L1_CACHE_VADDR_S))
#define EXTMEM_L1_CACHE_VADDR_V  0xFFFFFFFF
#define EXTMEM_L1_CACHE_VADDR_S  0

#define EXTMEM_L1_CACHE_DEBUG_BUS_REG          (DR_REG_EXTMEM_BASE + 0x254)
/* EXTMEM_L1_CACHE_DEBUG_BUS : R/W ;bitpos:[31:0] ;default: 32'h254 ; */
/*description: This is a constant place where we can write data to or read data from the tag/da
ta memory on the specified cache..*/
#define EXTMEM_L1_CACHE_DEBUG_BUS    0xFFFFFFFF
#define EXTMEM_L1_CACHE_DEBUG_BUS_M  ((EXTMEM_L1_CACHE_DEBUG_BUS_V)<<(EXTMEM_L1_CACHE_DEBUG_BUS_S))
#define EXTMEM_L1_CACHE_DEBUG_BUS_V  0xFFFFFFFF
#define EXTMEM_L1_CACHE_DEBUG_BUS_S  0

#define EXTMEM_DATE_REG          (DR_REG_EXTMEM_BASE + 0x3FC)
/* EXTMEM_DATE : R/W ;bitpos:[27:0] ;default: 28'h2202080 ; */
/*description: version control register. Note that this default value stored is the latest date
 when the hardware logic was updated..*/
#define EXTMEM_DATE    0x0FFFFFFF
#define EXTMEM_DATE_M  ((EXTMEM_DATE_V)<<(EXTMEM_DATE_S))
#define EXTMEM_DATE_V  0xFFFFFFF
#define EXTMEM_DATE_S  0

#ifdef __cplusplus
}
#endif
